"""
桨转动一圈前进的距离
http://www.wulong9.com/jiaocheng/20160901631.html
螺旋桨规格定义：直径(D) x 螺距(Pitch)
Pitch：螺距，桨转动一周前进的距离
R：桨半径
U：3/4*R处的平均叶片角度
转动一圈前进的距离Pitch = 3/4 * R * tan(U)
- 3/4半径处圆周长
    L = 2 * pi * (D/2*3/4) = pi * D * 3 / 4 (inch)
- 桨叶平均角度
    U = atan(Pitch/L) (deg)
如22x10桨，平均叶片角度是多少呢？
    L = 3.1415926 * 22 * 3 / 4 = 51.83627878423158 inch
    U = atan(10/L) = 10.919083051507858 deg
    `
    import numpy as np
    L = np.pi * 22 * 3 / 4
    U = np.arctan2(10,L)
    `
如果要进行变距操作，可根据螺旋桨前进的速度来改变螺距角

关于螺旋桨的另一点，
攻角：桨前进方向与翼弦中心线之间的夹角，一般稍低于叶片角度2~5度（视翼型）
"""
